<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"69c298f935af6671892d498b3afcafb445feeb99d971ba94edf4d201d3e646e1","plan_job_ref":"Job Write Terraform Plan to Pull Request #45 at https://github.com/hackforla/devops-security/actions/runs/9295984011","plan_out_hash":"6eeb2632ba9266424481f76be42eb2fa1617c16e38ded93acffc4bff32e80e73","plan_hash":"e938a388ba78b1b12780f11cc1403057a278b739446a3d1906def453ea75a16a","plan_text_format":"diff","version":"1.42.1"} -->
Terraform plan in __terraform__
<details>
<summary>Plan: 6 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.iam_user_jbubar.aws_iam_user.user will be created
+   resource "aws_iam_user" "user" {
+       arn           = (known after apply)
+       force_destroy = false
+       id            = (known after apply)
+       name          = "jbubar"
+       path          = "/"
+       tags          = {
+           "Access Level" = "1"
+           "Project"      = "vrms"
        }
+       tags_all      = {
+           "Access Level" = "1"
+           "Project"      = "vrms"
        }
+       unique_id     = (known after apply)
    }

  # module.iam_user_jbubar.aws_iam_user_group_membership.user_group_membership will be created
+   resource "aws_iam_user_group_membership" "user_group_membership" {
+       groups = [
+           "read-only-group",
        ]
+       id     = (known after apply)
+       user   = "jbubar"
    }

  # module.iam_user_jbubar.aws_iam_user_login_profile.user_login will be created
+   resource "aws_iam_user_login_profile" "user_login" {
+       encrypted_password      = (known after apply)
+       id                      = (known after apply)
+       key_fingerprint         = (known after apply)
+       password                = (known after apply)
+       password_length         = 20
+       password_reset_required = true
+       user                    = "jbubar"
    }

  # module.iam_user_spiteless.aws_iam_user.user will be created
+   resource "aws_iam_user" "user" {
+       arn           = (known after apply)
+       force_destroy = false
+       id            = (known after apply)
+       name          = "spiteless"
+       path          = "/"
+       tags          = {
+           "Access Level" = "1"
+           "Project"      = "vrms"
        }
+       tags_all      = {
+           "Access Level" = "1"
+           "Project"      = "vrms"
        }
+       unique_id     = (known after apply)
    }

  # module.iam_user_spiteless.aws_iam_user_group_membership.user_group_membership will be created
+   resource "aws_iam_user_group_membership" "user_group_membership" {
+       groups = [
+           "read-only-group",
        ]
+       id     = (known after apply)
+       user   = "spiteless"
    }

  # module.iam_user_spiteless.aws_iam_user_login_profile.user_login will be created
+   resource "aws_iam_user_login_profile" "user_login" {
+       encrypted_password      = (known after apply)
+       id                      = (known after apply)
+       key_fingerprint         = (known after apply)
+       password                = (known after apply)
+       password_length         = 20
+       password_reset_required = true
+       user                    = "spiteless"
    }

Plan: 6 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Write Terraform Plan to Pull Request #45](https://github.com/hackforla/devops-security/actions/runs/9295984011)